using System;
using System.Drawing;
using System.Windows.Forms;

namespace mandelbrot_set
{
    public partial class InfoForm : Form
    {

        private string about = "Ця програма створена для початкового ознайомлення з можливостями комп'ютерної графіки. З її допомогою можна здійснити генерування фракталу Мандельброта за заданими параметрами; здійснити перетворення кольрових моделей одна в іншу, а саме CMYK-HSL; а також здійснити комбінацію афінних перетворень для правильного чотирикутника, а саме поворот проти годинникової стрілки з одночасним вертикальним зміщенням за вказаними параметрами. \nВелкам он борд!";

        public InfoForm()
        {
            InitializeComponent();
        }

        private void button1_Click(object sender, EventArgs e)
        {
            var words = textBox1.Text.Split(',');
            foreach (var word in words)
            {
                int startInd = 0;
                while (startInd < richTextBox1.TextLength)
                {
                    int wordStartInd = richTextBox1.Find(word, startInd, RichTextBoxFinds.None);
                    if(wordStartInd != -1)
                    {
                        richTextBox1.SelectionStart = wordStartInd;
                        richTextBox1.SelectionLength = word.Length; ;
                        richTextBox1.SelectionBackColor = Color.Yellow;
                    }
                    else
                    {
                        break;
                    }

                    startInd += wordStartInd + word.Length;
                }
            }
        }

        private void button2_Click(object sender, EventArgs e)
        {
            richTextBox1.SelectionStart = 0;
            textBox1.Text = "";
            richTextBox1.SelectAll();
            richTextBox1.SelectionBackColor = Color.DarkSeaGreen;
        }

        private void treeView1_AfterSelect(object sender, TreeViewEventArgs e)
        {
            if(e.Node.Name == "content")
            {
                richTextBox1.Text = ""; 
            }
            if (e.Node.Name == "program")
            {
                richTextBox1.Text = about; 
            }
            if (e.Node.Name == "tr")
            {
                richTextBox1.Text = @"Афінне перетворення (лат. affinis, «пов'язаний з») — відображення площини або простору в собі, при якому паралельні прямі переходять у паралельні прямі, пересічні — в пересічні, мимобіжні — в мимобіжні. 
Інакше кажучи, відображення називається афінним, якщо його можна отримати таким способом:

1. Обрати «новий» базис простору з «новим» початком координат;
2. Координатам x кожної точки простору поставити у відповідність нові координати f (x), які мають те саме положення в просторі відносно «нової» системи координат, яке координати x мали в «старій».

Властивості:
* При афінному перетворені пряма переходить в пряму.
* Якщо розмірність простору n>= 2, то будь-яке перетворення простору (тобто бієкція простору на себе), яке переводить прямі в прямі, є афінним. Це визначення використовується в аксіоматичній побудові афінної геометрії
* Окремим випадком афінних перетворень є ізометрії та перетворення подібності.
* Афінні перетворення утворюють групу відносно композиції.
* Окремим випадком перспективної колінеації є перспективно-афінна відповідність плоских полей, встановлена паралельним проектуванням. Ці властивості паралельного проектування дозволяють встановити ті співвідношення між окремими елементами предмету, які відображаються при кресленні, тобто є інваріантами перетворення паралельним проектуванням.
"; 
            }
            if (e.Node.Name == "whattr")
            {
                richTextBox1.Text = "Правильний чотирикутник задається користувачем через координати його лівого нижнього кута. Рух цього квадрата реалізуваний на основі повороту відносно його центру проти годинникової стрілки з поступовим переміщенням (що задається користувачем або ж береться дефолтне значення) по вертикалі."; 
            }
            if (e.Node.Name == "whatmodels")
            {
                richTextBox1.Text = "У програмі реалізовані взаємні перетворення між колірними моделями СMYK і HSL; також є можливість змінити світлоту зображення по сірому кольору."; 
            }
            if (e.Node.Name == "cmodels")
            {
                richTextBox1.Text = "Колірна модель - система представлення кольорів за допомогою обмеженого числа фарб в поліграфії або колірних каналів монітора і інших випромінювальних пристроїв. Існує багато типів колірних моделей, але в комп'ютерній графіці, як правило, застосовуються три моделі, відомі під назвами RGB, CMYK, HSB. За принципом дії ці колірні моделі можна розбити на три класи: адитивні (RGB), побудовані на складання квітів; субтрактівниє (CMYK), основу якого становить операція віднімання квітів; перцепційне (HSB), що базуються на сприйнятті кольору."; 
            }
            if (e.Node.Name == "mand")
            {
                richTextBox1.Text = "Множина Мандельброта — обмежена та зв'язна множина на комплексній площині, межа якої утворює фрактал. Множина Мандельброта це множина комплексних чисел c, для яких функція f(z) = z^2 + c не розходиться, якщо її ітерувати від значення z=0. Названа на честь Бенуа Мандельброта, який вивчав і популяризував її. Точне значення площі множини Мандельброта невідоме."; 
            }
        }
    }
}
